{
  "module": "keras",
  "class_name": "Sequential",
  "config": {
    "name": "sequential_5",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": { "name": "float32" },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [null, 9],
          "dtype": "float32",
          "sparse": false,
          "name": "input_layer_5"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_20",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": {
            "module": "keras.regularizers",
            "class_name": "L2",
            "config": { "l2": 0.001 },
            "registered_name": null
          },
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 9] }
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_15",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 64] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_15",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "rate": 0.3,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_21",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 128,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": {
            "module": "keras.regularizers",
            "class_name": "L2",
            "config": { "l2": 0.001 },
            "registered_name": null
          },
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 64] }
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_16",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 128] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_16",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "rate": 0.3,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_22",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": {
            "module": "keras.regularizers",
            "class_name": "L2",
            "config": { "l2": 0.001 },
            "registered_name": null
          },
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 128] }
      },
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_17",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 64] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dropout",
        "config": {
          "name": "dropout_17",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "rate": 0.3,
          "seed": null,
          "noise_shape": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_23",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 64] }
      }
    ],
    "build_input_shape": [null, 9]
  },
  "registered_name": null,
  "build_config": { "input_shape": [null, 9] },
  "compile_config": {
    "loss": "binary_crossentropy",
    "loss_weights": null,
    "metrics": [
      "accuracy",
      {
        "module": "keras.metrics",
        "class_name": "Precision",
        "config": {
          "name": "precision",
          "dtype": "float32",
          "thresholds": null,
          "top_k": null,
          "class_id": null
        },
        "registered_name": null
      },
      {
        "module": "keras.metrics",
        "class_name": "Recall",
        "config": {
          "name": "recall",
          "dtype": "float32",
          "thresholds": null,
          "top_k": null,
          "class_id": null
        },
        "registered_name": null
      },
      {
        "module": "keras.metrics",
        "class_name": "AUC",
        "config": {
          "name": "auc",
          "dtype": "float32",
          "num_thresholds": 200,
          "curve": "ROC",
          "summation_method": "interpolation",
          "multi_label": false,
          "num_labels": null,
          "label_weights": null,
          "from_logits": false
        },
        "registered_name": null
      }
    ],
    "weighted_metrics": null,
    "run_eagerly": false,
    "steps_per_execution": 1,
    "jit_compile": false
  }
}
